[
  {
    "name": "Bard",
    "description": "Bards are the most charismatic people in all the realms, masters of captivation who specialize in a variety of performance types.",
    "domains": ["Grace", "Codex"],
    "starting_evasion": 10,
    "starting_hp": 5,
    "class_items": "A romance novel or a letter never opened",
    "suggested_traits": { "Strength": -1, "Agility": 0, "Finesse": 1, "Instinct": 0, "Presence": 2, "Knowledge": 1 },
    "hope_feature": { "name": "Make a Scene", "description": "Spend 3 Hope to temporarily Distract a target within Close range, giving them a -2 penalty to their Difficulty." },
    "class_feature": { "name": "Rally", "description": "Once per session, describe how you rally the party and give yourself and each of your allies a Rally Die. At level 1, your Rally Die is a d6. A PC can spend their Rally Die to roll it, adding the result to their action roll, reaction roll, damage roll, or to clear a number of Stress equal to the result." },
    "subclasses": [
      {
        "name": "Troubadour",
        "description": "Play the Troubadour if you want to play music to bolster your allies.",
        "spellcast_trait": "Presence",
        "foundation_feature": { "name": "Gifted Performer", "description": "You can play three different types of songs, once each per long rest:\n* Relaxing Song: You and all allies within Close range clear a Hit Point.\n* Epic Song: Make a target within Close range temporarily Vulnerable.\n* Heartbreaking Song: You and all allies within Close range gain a Hope." },
        "specialization_feature": { "name": "Maestro", "description": "Your rallying songs steel the courage of those who listen. When you give a Rally Die to an ally, they can gain a Hope or clear a Stress." },
        "mastery_feature": { "name": "Virtuoso", "description": "You are among the greatest of your craft and your skill is boundless. You can perform each of your 'Gifted Performer' feature's songs twice per long rest." }
      },
      {
        "name": "Wordsmith",
        "description": "Play the Wordsmith if you want to use clever wordplay and captivate crowds.",
        "spellcast_trait": "Presence",
        "foundation_feature": { "name": "Rousing Speech & Heart of a Poet", "description": "\n* Rousing Speech: Once per long rest, you can give a heartfelt, inspiring speech. All allies within Far range clear 2 Stress.\n* Heart of a Poet: After you make an action roll to impress, persuade, or offend someone, you can spend a Hope to add a d4 to the roll." },
        "specialization_feature": { "name": "Eloquent", "description": "Your moving words boost morale. Once per session, when you encourage an ally, you can do one of the following:\n* Allow them to find a mundane object or tool they need.\n* Help an Ally without spending Hope.\n* Give them an additional downtime move during their next rest." },
        "mastery_feature": { "name": "Epic Poetry", "description": "Your Rally Die increases to a d10. Additionally, when you Help an Ally, you can narrate the moment as if you were writing the tale of their heroism in a memoir. When you do, roll a d10 as your advantage die." }
      }
    ]
  },
  {
    "name": "Druid",
    "description": "Becoming a druid is a calling for those who wish to learn from and protect the magic of the wilderness.",
    "domains": ["Sage", "Arcana"],
    "starting_evasion": 10,
    "starting_hp": 6,
    "class_items": "A small bag of rocks and bones or a strange pendant found in the dirt",
    "suggested_traits": { "Strength": 0, "Agility": 1, "Finesse": -1, "Instinct": 2, "Presence": 1, "Knowledge": 0 },
    "hope_feature": { "name": "Evolution", "description": "Spend 3 Hope to transform into a Beastform without marking a Stress. When you do, choose one trait to raise by +1 until you drop out of that Beastform." },
    "class_feature": { "name": "Beastform & Wildtouch", "description": "\n* Beastform: Mark a Stress to magically transform into a creature of your tier or lower from the Beastform list. You can drop out of this form at any time. While transformed, you can't use weapons or cast spells from domain cards, but you can still use other features or abilities. Spells cast before you transform stay active.\n* Wildtouch: You can perform harmless, subtle effects that involve nature at will." },
    "subclasses": [
      {
        "name": "Warden of the Elements",
        "description": "Play the Warden of the Elements if you want to embody the natural elements of the wild.",
        "spellcast_trait": "Instinct",
        "foundation_feature": { "name": "Elemental Incarnation", "description": "Mark a Stress to Channel one of the following elements until you take Severe damage or your next rest:\n* Fire: When an adversary within Melee range deals damage to you, they take 1d10 magic damage.\n* Earth: Gain a bonus to your damage thresholds equal to your Proficiency.\n* Water: When you deal damage to an adversary within Melee range, all other adversaries within Very Close range must mark a Stress.\n* Air: You can hover, gaining advantage on Agility Rolls." },
        "specialization_feature": { "name": "Elemental Aura", "description": "Once per rest while Channeling, you can assume an aura matching your element. The aura affects targets within Close range until your Channeling ends.\n* Fire: When an adversary marks 1 or more Hit Points, they must also mark a Stress.\n* Earth: Your allies gain a +1 bonus to Strength.\n* Water: When an adversary deals damage to you, you can mark a Stress to move them anywhere within Very Close range.\n* Air: When you or an ally takes damage from an attack beyond Melee range, reduce the damage by 1d8." },
        "mastery_feature": { "name": "Elemental Dominion", "description": "You further embody your element. While Channeling, you gain the following benefit:\n* Fire: You gain a +1 bonus to your Proficiency for attacks and spells that deal damage.\n* Earth: When you would mark Hit Points, roll a d6 per Hit Point marked. For each 6, reduce the Hit Points you mark by 1.\n* Water: When an attack against you succeeds, you can mark a Stress to make the attacker temporarily Vulnerable.\n* Air: You gain a +1 bonus to your Evasion and can fly." }
      },
      {
        "name": "Warden of Renewal",
        "description": "Play the Warden of Renewal if you want to use powerful magic to heal your party.",
        "spellcast_trait": "Instinct",
        "foundation_feature": { "name": "Clarity of Nature & Regeneration", "description": "\n* Clarity of Nature: Once per long rest, create a space of natural serenity within Close range. When you spend a few minutes resting within the space, clear Stress equal to your Instinct, distributed as you choose between you and your allies.\n* Regeneration: Touch a creature and spend 3 Hope. That creature clears 1d4 Hit Points." },
        "specialization_feature": { "name": "Regenerative Reach & Warden's Protection", "description": "\n* Regenerative Reach: You can target creatures within Very Close range with your 'Regeneration' feature.\n* Warden's Protection: Once per long rest, spend 2 Hope to clear 2 Hit Points on 1d4 allies within Close range." },
        "mastery_feature": { "name": "Defender", "description": "Your animal transformation embodies a healing guardian spirit. When you're in Beastform and an ally within Close range marks 2 or more Hit Points, you can mark a Stress to reduce the number of Hit Points they mark by 1." }
      }
    ]
  },
  {
    "name": "Guardian",
    "description": "Guardians are known for fighting with remarkable ferocity even against overwhelming odds, defending their cohort above all else.",
    "domains": ["Valor", "Blade"],
    "starting_evasion": 9,
    "starting_hp": 7,
    "class_items": "A totem from your mentor or a secret key",
    "suggested_traits": { "Strength": 2, "Agility": 0, "Finesse": -1, "Instinct": 0, "Presence": 1, "Knowledge": 1 },
    "hope_feature": { "name": "Frontline Tank", "description": "Spend 3 Hope to clear 2 Armor Slots." },
    "class_feature": { "name": "Unstoppable", "description": "Once per long rest, you can become Unstoppable. You gain an Unstoppable Die (d4 at level 1). While Unstoppable, you reduce incoming physical damage severity by one threshold, add the die's current value to damage rolls, and can't be Restrained or Vulnerable." },
    "subclasses": [
      {
        "name": "Stalwart",
        "description": "Play the Stalwart if you want to take heavy blows and keep fighting.",
        "spellcast_trait": null,
        "foundation_feature": { "name": "Unwavering & Iron Will", "description": "\n* Unwavering: Gain a permanent +1 bonus to your damage thresholds.\n* Iron Will: When you take physical damage, you can mark an additional Armor Slot to reduce the severity." },
        "specialization_feature": { "name": "Unrelenting & Partners-in-Arms", "description": "\n* Unrelenting: Gain a permanent +2 bonus to your damage thresholds.\n* Partners-in-Arms: When an ally within Very Close range takes damage, you can mark an Armor Slot to reduce the severity by one threshold." },
        "mastery_feature": { "name": "Undaunted & Loyal Protector", "description": "\n* Undaunted: Gain a permanent +3 bonus to your damage thresholds.\n* Loyal Protector: When an ally within Close range has 2 or fewer Hit Points and would take damage, you can mark a Stress to sprint to their side and take the damage instead." }
      },
      {
        "name": "Vengeance",
        "description": "Play the Vengeance if you want to strike down enemies who harm you or your allies.",
        "spellcast_trait": null,
        "foundation_feature": { "name": "At Ease & Revenge", "description": "\n* At Ease: Gain an additional Stress slot.\n* Revenge: When an adversary within Melee range succeeds on an attack against you, you can mark 2 Stress to force the attacker to mark a Hit Point." },
        "specialization_feature": { "name": "Act of Reprisal", "description": "When an adversary damages an ally within Melee range, you gain a +1 bonus to your Proficiency for the next successful attack you make against that adversary." },
        "mastery_feature": { "name": "Nemesis", "description": "Spend 2 Hope to Prioritize an adversary until your next rest. When you make an attack against your Prioritized adversary, you can swap the results of your Hope and Fear Dice. You can only Prioritize one adversary at a time." }
      }
    ]
  },
  {
    "name": "Ranger",
    "description": "Rangers are highly skilled hunters who become sly tacticians, pursuing their quarry with cunning and patience.",
    "domains": ["Bone", "Sage"],
    "starting_evasion": 12,
    "starting_hp": 6,
    "class_items": "A trophy from your first kill or a seemingly broken compass",
    "suggested_traits": { "Strength": 0, "Agility": 2, "Finesse": 1, "Instinct": 1, "Presence": 0, "Knowledge": -1 },
    "hope_feature": { "name": "Hold Them Off", "description": "Spend 3 Hope when you succeed on an attack with a weapon to use that same roll against two additional adversaries within range of the attack." },
    "class_feature": { "name": "Ranger's Focus", "description": "Spend a Hope on a successful attack to make the target your Focus. You always know their direction, they mark Stress when you damage them, and you can reroll a failed attack against them by ending the Focus." },
    "subclasses": [
      {
        "name": "Beastbound",
        "description": "Play the Beastbound if you want to form a deep bond with an animal ally.",
        "spellcast_trait": "Agility",
        "foundation_feature": { "name": "Companion", "description": "You have an animal companion of your choice. Take the Ranger Companion sheet and choose a level-up option for them when you level up." },
        "specialization_feature": { "name": "Expert Training & Battle-Bonded", "description": "\n* Expert Training: Choose an additional level-up option for your companion.\n* Battle-Bonded: When an adversary attacks you while they're within your companion's Melee range, you gain a +2 bonus to your Evasion against the attack." },
        "mastery_feature": { "name": "Advanced Training & Loyal Friend", "description": "\n* Advanced Training: Choose two additional level-up options for your companion.\n* Loyal Friend: Once per long rest, when the damage from an attack would mark your companion's last Stress or your last Hit Point and you're within Close range of each other, you or your companion can rush to the other's side and take that damage instead." }
      },
      {
        "name": "Wayfinder",
        "description": "Play the Wayfinder if you want to hunt your prey and strike with deadly force.",
        "spellcast_trait": "Agility",
        "foundation_feature": { "name": "Ruthless Predator & Path Forward", "description": "\n* Ruthless Predator: When you make a damage roll, you can mark a Stress to gain a +1 bonus to your Proficiency. Additionally, when you deal Severe damage, the adversary marks a Stress.\n* Path Forward: You can identify the shortest path to a place you've visited before." },
        "specialization_feature": { "name": "Elusive Predator", "description": "When your Focus makes an attack against you, you gain a +2 bonus to your Evasion against the attack." },
        "mastery_feature": { "name": "Apex Predator", "description": "Before you make an attack roll against your Focus, you can spend a Hope. On a successful attack, you remove a Fear from the GM's Fear pool." }
      }
    ]
  },
  {
    "name": "Rogue",
    "description": "Rogues are scoundrels who utilize sharp wits and blades, tricking foes through manipulation as easily as dealing underhanded blows.",
    "domains": ["Midnight", "Grace"],
    "starting_evasion": 12,
    "starting_hp": 6,
    "class_items": "A set of forgery tools or a grappling hook",
    "suggested_traits": { "Strength": -1, "Agility": 1, "Finesse": 2, "Instinct": 1, "Presence": 0, "Knowledge": 0 },
    "hope_feature": { "name": "Rogue's Dodge", "description": "Spend 3 Hope to gain a +2 bonus to your Evasion until the next time an attack succeeds against you." },
    "class_feature": { "name": "Cloaked & Sneak Attack", "description": "\n* Cloaked: Any time you would be Hidden, you are instead Cloaked. While Cloaked you remain unseen if you are stationary when an adversary moves to where they would normally see you. After you make an attack or move within line of sight of an adversary, you are no longer Cloaked.\n* Sneak Attack: When you succeed on an attack while Cloaked or while an ally is within Melee range of your target, add a number of d6s equal to your tier to your damage roll." },
    "subclasses": [
      {
        "name": "Nightwalker",
        "description": "Play the Nightwalker if you want to manipulate shadows to maneuver through the environment.",
        "spellcast_trait": "Finesse",
        "foundation_feature": { "name": "Shadow Stepper", "description": "When you move into a shadow, you can mark a Stress to teleport to another shadow within Far range and become Cloaked." },
        "specialization_feature": { "name": "Dark Cloud & Adrenaline", "description": "\n* Dark Cloud: Make a Spellcast Roll (15). On a success, create a temporary dark cloud that covers any area within Close range. Anyone in this cloud can't see outside of it, and anyone outside of it can't see in. You're considered Cloaked from any adversary for whom the cloud blocks line of sight.\n* Adrenaline: While you're Vulnerable, add your level to your damage rolls." },
        "mastery_feature": { "name": "Fleeting Shadow & Vanishing Act", "description": "\n* Fleeting Shadow: Gain a permanent +1 bonus to your Evasion. You can use your 'Shadow Stepper' feature to move within Very Far range.\n* Vanishing Act: Mark a Stress to become Cloaked at any time. When Cloaked from this feature, you automatically clear the Restrained condition if you have it. You remain Cloaked in this way until you roll with Fear or until your next rest." }
      },
      {
        "name": "Syndicate",
        "description": "Play the Syndicate if you want to have a web of contacts everywhere you go.",
        "spellcast_trait": "Finesse",
        "foundation_feature": { "name": "Well-Connected", "description": "When you arrive in a prominent town or environment, you know somebody who calls this place home. Give them a name and choose a fact about your relationship (e.g., They owe me a favor, we didn't part on great terms)." },
        "specialization_feature": { "name": "Contacts Everywhere", "description": "Once per session, you can briefly call on a shady contact. Choose one of the following benefits:\n* They provide 1 handful of gold, a unique tool, or a mundane object.\n* On your next action roll, their help provides a +3 bonus to the result of your Hope or Fear Die.\n* The next time you deal damage, they snipe from the shadows, adding 2d8 to your damage roll." },
        "mastery_feature": { "name": "Reliable Backup", "description": "You can use your 'Contacts Everywhere' feature three times per session. The following options are added to the list of benefits:\n* When you mark 1 or more Hit Points, they can rush out to shield you, reducing the Hit Points marked by 1.\n* When you make a Presence Roll in conversation, they back you up. You can roll a d20 as your Hope Die." }
      }
    ]
  },
  {
    "name": "Seraph",
    "description": "Seraphs are divine fighters and healers imbued with sacred purpose, appointed by a wide array of deities.",
    "domains": ["Splendor", "Valor"],
    "starting_evasion": 9,
    "starting_hp": 7,
    "class_items": "A bundle of offerings or a sigil of your god",
    "suggested_traits": { "Strength": 2, "Agility": -1, "Finesse": 0, "Instinct": 1, "Presence": 1, "Knowledge": 0 },
    "hope_feature": { "name": "Life Support", "description": "Spend 3 Hope to clear a Hit Point on an ally within Close range." },
    "class_feature": { "name": "Prayer Dice", "description": "At the start of each session, roll a number of d4s equal to your subclass's Spellcast trait. You can spend these dice to reduce incoming damage, add to a roll's result after the roll is made, or gain Hope equal to the result." },
    "subclasses": [
      {
        "name": "Divine Wielder",
        "description": "Play the Divine Wielder if you want to dominate the battlefield with a legendary weapon.",
        "spellcast_trait": "Strength",
        "foundation_feature": { "name": "Spirit Weapon & Sparing Touch", "description": "\n* Spirit Weapon: Your equipped Melee or Very Close range weapon can fly to attack a target within Close range. You can mark a Stress to target an additional adversary.\n* Sparing Touch: Once per long rest, touch a creature and clear 2 Hit Points or 2 Stress from them." },
        "specialization_feature": { "name": "Devout", "description": "When you roll your Prayer Dice, you can roll an additional die and discard the lowest result. Additionally, you can use your 'Sparing Touch' feature twice instead of once per long rest." },
        "mastery_feature": { "name": "Sacred Resonance", "description": "When you roll damage for your 'Spirit Weapon' feature, if any of the die results match, double the value of each matching die." }
      },
      {
        "name": "Winged Sentinel",
        "description": "Play the Winged Sentinel if you want to take flight and strike crushing blows from the sky.",
        "spellcast_trait": "Strength",
        "foundation_feature": { "name": "Wings of Light", "description": "You can fly. While flying, you can:\n* Mark a Stress to carry another willing creature.\n* Spend a Hope to deal an extra 1d8 damage on a successful attack." },
        "specialization_feature": { "name": "Ethereal Visage", "description": "Your supernatural visage strikes awe and fear. While flying, you have advantage on Presence Rolls. When you succeed with Hope on a Presence Roll, you can remove a Fear from the GM's Fear pool instead of gaining Hope." },
        "mastery_feature": { "name": "Ascendant & Power of the Gods", "description": "\n* Ascendant: Gain a permanent +4 bonus to your Severe damage threshold.\n* Power of the Gods: While flying, you deal an extra 1d12 damage instead of 1d8 from your 'Wings of Light' feature." }
      }
    ]
  },
  {
    "name": "Sorcerer",
    "description": "Sorcerers learn to cultivate and control the innate magical power they already possess.",
    "domains": ["Arcana", "Midnight"],
    "starting_evasion": 10,
    "starting_hp": 6,
    "class_items": "A whispering orb or a family heirloom",
    "suggested_traits": { "Strength": -1, "Agility": 0, "Finesse": 1, "Instinct": 2, "Presence": 1, "Knowledge": 0 },
    "hope_feature": { "name": "Volatile Magic", "description": "Spend 3 Hope to reroll any number of your damage dice on an attack that deals magic damage." },
    "class_feature": { "name": "Arcane Sense, Minor Illusion & Channel Raw Power", "description": "\n* Arcane Sense: You can sense the presence of magical people and objects within Close range.\n* Minor Illusion: Make a Spellcast Roll (10) to create a minor visual illusion.\n* Channel Raw Power: Once per long rest, vault a domain card to either gain Hope equal to the card's level, or enhance a spell's damage roll by twice the card's level." },
    "subclasses": [
      {
        "name": "Elemental Origin",
        "description": "Play the Elemental Origin if you want to channel raw magic to take the shape of a particular element.",
        "spellcast_trait": "Instinct",
        "foundation_feature": { "name": "Elementalist", "description": "Choose an element (air, earth, fire, lightning, water). You can shape it for harmless effects. Additionally, spend a Hope and describe how your control over this element helps an action roll you're about to make, then either gain a +2 bonus to the roll or a +3 bonus to the roll's damage." },
        "specialization_feature": { "name": "Natural Evasion", "description": "You can call forth your element to protect you from harm. When an attack roll against you succeeds, you can mark a Stress and describe how you use your element to defend you. When you do, roll a d6 and add its result to your Evasion against the attack." },
        "mastery_feature": { "name": "Transcendence", "description": "Once per long rest, you can transform into a physical manifestation of your element. When you do, describe your transformation and choose two of the following benefits to gain until your next rest:\n* +4 bonus to your Severe threshold.\n* +1 bonus to a character trait of your choice.\n* +1 bonus to your Proficiency.\n* +2 bonus to your Evasion." }
      },
      {
        "name": "Primal Origin",
        "description": "Play the Primal Origin if you want to extend the versatility of your spells in powerful ways.",
        "spellcast_trait": "Instinct",
        "foundation_feature": { "name": "Manipulate Magic", "description": "Your primal origin allows you to modify the essence of magic itself. After you cast a spell or make an attack using a weapon that deals magic damage, you can mark a Stress to do one of the following:\n* extend its range by one step.\n* gain a +2 bonus to the roll's result.\n* double a damage die of your choice.\n* hit an additional target within range." },
        "specialization_feature": { "name": "Enchanted Aid", "description": "You can enhance the magic of others with your essence. When you Help an Ally with a Spellcast Roll, you can roll a d8 as your advantage die. Once per long rest, after an ally has made a Spellcast Roll with your help, you can swap the results of their Duality Dice." },
        "mastery_feature": { "name": "Arcane Charge", "description": "You can gather magical energy to enhance your capabilities. When you take magic damage, you become Charged. Alternatively, you can spend 2 Hope to become Charged. When you successfully make an attack that deals magic damage while Charged, you can clear your Charge to either gain a +10 bonus to the damage roll or gain a +3 bonus to the Difficulty of a reaction roll the spell causes the target to make. You stop being Charged at your next long rest." }
      }
    ]
  },
  {
    "name": "Warrior",
    "description": "Warriors require years of training and dedication to the mastery of weapons and violence.",
    "domains": ["Blade", "Bone"],
    "starting_evasion": 11,
    "starting_hp": 6,
    "class_items": "The drawing of a lover or a sharpening stone",
    "suggested_traits": { "Strength": 2, "Agility": 1, "Finesse": 1, "Instinct": 0, "Presence": -1, "Knowledge": 0 },
    "hope_feature": { "name": "No Mercy", "description": "Spend 3 Hope to gain a +1 bonus to your attack rolls until your next rest." },
    "class_feature": { "name": "Attack of Opportunity & Combat Training", "description": "\n* Attack of Opportunity: If an adversary within Melee range attempts to leave that range, make a reaction roll. Choose one effect on a success, or two if you critically succeed:\n* They can't move.\n* you deal damage equal to your primary weapon's damage.\n* or you move with them.\n* Combat Training: You ignore burden when equipping weapons. When you deal physical damage, you gain a bonus to your damage roll equal to your level." },
    "subclasses": [
      {
        "name": "Call of the Brave",
        "description": "Play the Call of the Brave if you want to use the might of your enemies to fuel your own power.",
        "spellcast_trait": null,
        "foundation_feature": { "name": "Courage & Battle Ritual", "description": "\n* Courage: When you fail a roll with Fear, you gain a Hope.\n* Battle Ritual: Once per long rest, before you attempt something incredibly dangerous, describe what ritual you perform. When you do, clear 2 Stress and gain 2 Hope." },
        "specialization_feature": { "name": "Rise to the Challenge", "description": "You are vigilant in the face of mounting danger. While you have 2 or fewer Hit Points unmarked, you can roll a d20 as your Hope Die." },
        "mastery_feature": { "name": "Camaraderie", "description": "Your unwavering bravery is a rallying point for your allies. You can initiate a Tag Team Roll one additional time per session. Additionally, when an ally initiates a Tag Team Roll with you, they only need to spend 2 Hope to do so." }
      },
      {
        "name": "Call of the Slayer",
        "description": "Play the Call of the Slayer if you want to strike down adversaries with immense force.",
        "spellcast_trait": null,
        "foundation_feature": { "name": "Slayer", "description": "You gain a pool of Slayer Dice. On a roll with Hope, you can place a d6 on this card instead of gaining a Hope. You can store a number of Slayer Dice equal to your Proficiency. When you make an attack or damage roll, you can spend any number of these dice, rolling them and adding their result to the roll." },
        "specialization_feature": { "name": "Weapon Specialist", "description": "When you succeed on an attack, you can spend a Hope to add one of the damage dice from your secondary weapon to the damage roll. Additionally, once per long rest when you roll your Slayer Dice, reroll any 1s." },
        "mastery_feature": { "name": "Martial Preparation", "description": "Your party gains access to the Martial Preparation downtime move. To use this move during a rest, describe how you instruct and train with your party. You and each ally who chooses this move gain a d6 Slayer Die." }
      }
    ]
  },
  {
    "name": "Wizard",
    "description": "Wizards acquire and hone immense magical power over years of learning using a variety of tools.",
    "domains": ["Codex", "Splendor"],
    "starting_evasion": 11,
    "starting_hp": 5,
    "class_items": "A book you're trying to translate or a tiny, harmless elemental pet",
    "suggested_traits": { "Strength": -1, "Agility": 0, "Finesse": 1, "Instinct": 1, "Presence": 0, "Knowledge": 2 },
    "hope_feature": { "name": "Not This Time", "description": "Spend 3 Hope to force an adversary within Far range to reroll an attack or damage roll." },
    "class_feature": { "name": "Prestidigitation & Strange Patterns", "description": "\n* Prestidigitation: You can perform harmless, subtle magical effects at will.\n* Strange Patterns: Choose a number between 1 and 12. When you roll that number on a Duality Die, gain a Hope or clear a Stress." },
    "subclasses": [
      {
        "name": "School of Knowledge",
        "description": "Play the School of Knowledge if you want a keen understanding of the world around you.",
        "spellcast_trait": "Knowledge",
        "foundation_feature": { "name": "Prepared & Adept", "description": "\n* Prepared: Take an additional domain card of your level or lower.\n* Adept: When you Utilize an Experience, you can mark a Stress instead of spending a Hope. If you do, double your Experience modifier for that roll." },
        "specialization_feature": { "name": "Accomplished & Perfect Recall", "description": "\n* Accomplished: Take an additional domain card of your level or lower.\n* Perfect Recall: Once per rest, when you recall a domain card in your vault, you can reduce its Recall Cost by 1." },
        "mastery_feature": { "name": "Brilliant & Honed Expertise", "description": "\n* Brilliant: Take an additional domain card of your level or lower.\n* Honed Expertise: When you use an Experience, roll a d6. On a result of 5 or higher, you can use it without spending Hope." }
      },
      {
        "name": "School of War",
        "description": "Play the School of War if you want to utilize trained magic for violence.",
        "spellcast_trait": "Knowledge",
        "foundation_feature": { "name": "Battlemage & Face Your Fear", "description": "\n* Battlemage: You've focused your studies on becoming an unconquerable force on the battlefield. Gain an additional Hit Point slot.\n* Face Your Fear: When you succeed with Fear on an attack roll, you deal an extra 1d10 magic damage." },
        "specialization_feature": { "name": "Conjure Shield & Fueled by Fear", "description": "\n* Conjure Shield: While you have at least 2 Hope, you add your Proficiency to your Evasion.\n* Fueled by Fear: The extra magic damage from your 'Face Your Fear' feature increases to 2d10." },
        "mastery_feature": { "name": "Thrive in Chaos & Have No Fear", "description": "\n* Thrive in Chaos: When you succeed on an attack, you can mark a Stress after rolling damage to force the target to mark an additional Hit Point.\n* Have No Fear: The extra magic damage from your 'Face Your Fear' feature increases to 3d10." }
      }
    ]
  }},
  {
    "name": "My Custom Class",
    "description": "A description of your awesome new class.",
    "domains": ["Blade", "Grace"],
    "starting_evasion": 10,
    "starting_hp": 6,
    "class_items": "A custom item or a cool trinket",
    "suggested_traits": { "Strength": 2, "Agility": 1, "Finesse": 0, "Instinct": 0, "Presence": 1, "Knowledge": -1 },
    "hope_feature": { 
      "name": "My Hope Feature", 
      "description": "Spend 3 Hope to do something cool." 
    },
    "class_feature": { 
      "name": "My Class Feature", 
      "description": "This is what my class can do." 
    },
    "subclasses": [
      {
        "name": "Custom Subclass A",
        "description": "The first path.",
        "spellcast_trait": "Strength",
        "foundation_feature": { 
          "name": "Foundation A", 
          "description": "A cool starting ability." 
        },
        "specialization_feature": { 
          "name": "Specialization A", 
          "description": "A level-up ability." 
        },
        "mastery_feature": { 
          "name": "Mastery A", 
          "description": "A high-level ability." 
        }
      },
      {
        "name": "Custom Subclass B",
        "description": "The second path.",
        "spellcast_trait": null,
        "foundation_feature": { 
          "name": "Foundation B", 
          "description": "Another starting ability." 
        },
        "specialization_feature": { 
          "name": "Specialization B", 
          "description": "Another level-up ability." 
        },
        "mastery_feature": { 
          "name": "Mastery B", 
          "description": "Another high-level ability." 
        }
      }
    ]
  }
]
